frontend/views/layouts/main.php

	//print_r(Yii::$app->user->identity);
	//die();
	if(Yii::$app->user->identity != null){//Esto verifica si existe el usuario o no, null si no existe
		$rol = User::findOne(Yii::$app->user->identity->id)->rol->nombre;
		$rolID = User::findOne(Yii::$app->user->identity->id)->rol->id;
---
SELECT * FROM `rol` WHERE `id`=20
SELECT * FROM `user` WHERE `id`=3